Revit 2027 API
UIView Properties
The UIView type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ViewId |  The id of the View associated with a UIView.
Top
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace